package com.teamtop.system.achievement;

public enum AchievementEnum {
	/**
	 * 需玩家镶嵌的xx级宝石数量达到yy个
	 */
	GOAL_1(1),
	/**
	 * 需玩家技能总等级之和达到XX
	 */
	GOAL_2(2),
	/**
	 * 需玩家的神装套装等级达到xx阶
	 */
	GOAL_3(3),
	/**
	 * 需玩家拥有xx个yy阶的星图
	 */
	// GOAL_4(4),
	/**
	 * 需玩家总战力达到XX
	 */
	GOAL_5(5),
	/**
	 * 需玩家晋升等级达到xx级
	 */
	GOAL_6(6),
	/**
	 * 需玩家激活的武将数量达到xx个
	 */
	GOAL_7(7),
	/**
	 * 需玩家红色品质武将总星级达到xx星
	 */
	GOAL_8(8),
	/**
	 * 需玩家激活的战甲数量达到xx个
	 */
	GOAL_9(9),
	/**
	 * 需玩家红色品质战甲总星级达到xx星
	 */
	GOAL_10(10),
	/**
	 * 需玩家激活的宝物数量达到xx个
	 */
	GOAL_11(11),
	/**
	 * 需玩家红色品质宝物总星级达到xx星
	 */
	GOAL_12(12),
	/**
	 * 需玩家激活的神剑数量达到xx个
	 */
	GOAL_13(13),
	/**
	 * 需玩家红色品质神剑总星级达到xx星
	 */
	GOAL_14(14),
	/**
	 * 需玩家激活的异宝数量达到xx个
	 */
	GOAL_15(15),
	/**
	 * 需玩家红色品质异宝总星级达到xx星
	 */
	GOAL_16(16),
	/**
	 * 需玩家激活的兵法数量达到xx个
	 */
	GOAL_17(17),
	/**
	 * 需玩家红色品质兵法总星级达到xx星
	 */
	GOAL_18(18),
	/**
	 * 需玩家激活的时装数量达到xx个
	 */
	GOAL_19(19),
	/**
	 * 需玩家红色武将时装总星级达到xx星
	 */
	GOAL_20(20),
	/**
	 * 需玩家激活的图鉴数量达到xx个
	 */
	GOAL_21(21),
	/**
	 * 需玩家红色品质的图鉴总星级达到xx星
	 */
	GOAL_22(22),
	/**
	 * 需玩家激活的天书数量达到xx个
	 */
	GOAL_23(23),
	/**
	 * 需玩家红色品质天书总星级达到xx星
	 */
	GOAL_24(24),
	/**
	 * 需玩家激活的将魂数量达到xx
	 */
	GOAL_25(25),
	/**
	 * 需玩家激活的异兽数量达到xx个
	 */
	GOAL_26(26),
	/**
	 * 需玩家激活的异兽天赋技能数量达到xx个
	 */
	GOAL_27(27),
	/**
	 * 需玩家激活的神兵达到y个
	 */
	GOAL_28(28),
	/**
	 * 需玩家红色品质神兵总星级达到xx星
	 */
	GOAL_29(29),
	/**
	 * 需玩家激活的奇策达到x个
	 */
	GOAL_30(30),
	/**
	 * 需玩家红色品质奇策总星级达到xx星
	 */
	GOAL_31(31),
	/**
	 * 需玩家达到xx星的阵眼达到yy个
	 */
	GOAL_32(32),
	/**
	 * 需玩家的少主刘禅达到yy星
	 */
	GOAL_33(33),
	/**
	 * 需玩家的少主曹冲达到yy星
	 */
	GOAL_34(34),
	/**
	 * 需玩家的少主孙鲁育达到yy星
	 */
	GOAL_35(35),
	/**
	 * 需玩家达到xx关
	 */
	GOAL_36(36),
	/**
	 * 需玩家通关铜雀台xx层
	 */
	GOAL_37(37),
	/**
	 * 需玩家通关过关斩将xx层
	 */
	// GOAL_38(38),
	/**
	 * 需玩家通关火烧赤壁xx层
	 */
	GOAL_39(39),
	/**
	 * 需玩家在七擒孟获中获得第x名的次数达到y次（获得奖励才算）
	 */
	GOAL_40(40),
	/**
	 * 需玩家在魔神吕布中获得第x名的次数达到y次
	 */
	GOAL_41(41),
	/**
	 * 需玩家在单刀赴会达到第x段位累计y次
	 */
	GOAL_42(42),
	/**
	 * 需玩家在乱世枭雄达到第x段位累计y次
	 */
	GOAL_43(43),
	/**
	 * 需玩家VIP等级达到xx
	 */
	GOAL_44(44),
	/**
	 * 需玩家激活不同特权卡的数量达到xx个（周卡也算在内，激活过1次就算）
	 */
	GOAL_45(45),
	;
	
	private int type;

	AchievementEnum(int type) {
		this.type = type;
	}

	public int getType() {
		return type;
	}

	public void setType(int type) {
		this.type = type;
	}

}
