package excel.config;
import com.teamtop.util.excel.ConfigBase;
import excel.struct.Struct_appts_313;
public class Config_appts_313 extends ConfigBase<Struct_appts_313> {
    private static Config_appts_313 ins = null;
    public static Config_appts_313 getIns(){
        if(ins==null){
            ins = new Config_appts_313();
        }
        return ins;
    }
    private Config_appts_313(){
        put(1001,new Struct_appts_313(1001,"魔神吕布",1805,1,"魔神无道，天下共伐之！","魔神吕布即将降临，击杀可得海量元宝！","0","0","0","0",0,"[1,2,3,4,5,6,7]","12:27",0));
        put(1002,new Struct_appts_313(1002,"魔神吕布",1805,1,"魔神无道，天下共伐之！","魔神吕布即将降临，击杀可得海量元宝！","0","0","0","0",0,"[1,2,3,4,5,6,7]","18:27",0));
        put(1003,new Struct_appts_313(1003,"魔神吕布",1805,1,"魔神无道，天下共伐之！","魔神吕布即将降临，击杀可得海量元宝！","0","0","0","0",0,"[1,2,3,4,5,6,7]","21:27",0));
        put(2001,new Struct_appts_313(2001,"隆中对",3702,0,"隆中对","尔等吴下阿蒙，不服来战！","群儒如积薪耳，唯我后来者居上！","0","0","0",0,"[1,2,3,4,5,6,7]","12:00",0));
        put(3001,new Struct_appts_313(3001,"烽火狼烟",3703,1,"烽火狼烟","各位主公，战鼓已响，是时候一举拿下皇城了！","各位主公，狼烟已起，决战皇城势在必得！","烽火狼烟即将开启，快来抢夺皇城吧","烽火狼烟即将开启，各位主公抱大腿的时候到了！","0",4,"[1,3,5]","19:57",0));
        put(4001,new Struct_appts_313(4001,"问鼎天下",3705,1,"群雄鏖战","问鼎天下即将开启，炫酷称号与曹操碎片，等你一战！","各位主公，只要跑得快，就没人追的上你！","各位主公，逐鹿中原，问鼎天下，一将功成万骨枯！","各位主公，问鼎天下即将开启，快来一战成名吧！","[1,3]",4,"0","19:57",1));
        put(4002,new Struct_appts_313(4002,"问鼎天下",3705,1,"群雄鏖战","问鼎天下即将开启，炫酷称号与曹操碎片，等你一战！","各位主公，只要跑得快，就没人追的上你！","各位主公，逐鹿中原，问鼎天下，一将功成万骨枯！","各位主公，问鼎天下即将开启，快来一战成名吧！","0",4,"[2,4,6]","19:57",1));
        put(5001,new Struct_appts_313(5001,"枭雄争霸",3603,0,"枭雄争霸","我本枭雄，谁与我大战三百回合！","各位主公，枭雄争霸即将开启，快来一决高下吧！","0","0","0",0,"[7]","19:27",0));
        put(6001,new Struct_appts_313(6001,"单刀赴会",1603,1,"单刀赴会","1vs1实时竞技，藐视吴臣若小儿，单刀赴会敢平欺！","我有40米的大刀，刀前无一合之敌，刀下无全尸之鬼~","我的大刀，早已饥渴难耐了！","0","0",0,"[1,2,3,4,5,6]","20:27",0));
        put(7001,new Struct_appts_313(7001,"三国无双",1604,0,"三国无双","各位主公，三国无双即将开启，快来一决高下吧！","","0","0","0",0,"[7]","20:27",0));
        put(8001,new Struct_appts_313(8001,"武圣榜(开服七天前)",4901,0,"武圣榜","各位主公，武圣榜即将结算，谁是那屠榜第一人！","各位主公，武圣榜即将结算，榜单前十可获得丰厚奖励哦~","0","0","[1,2,3,4,5,6,7]",7,"0","23:50",0));
        put(9001,new Struct_appts_313(9001,"群英榜(开服七天后)",4401,0,"群英榜","各位主公，群英榜即将结算，谁是那屠榜第一人！","各位主公，群英榜即将结算，榜单前十可获得丰厚奖励哦~","0","0","0",8,"[1,2,3,4,5,6,7]","23:50",0));
        put(10001,new Struct_appts_313(10001,"乱世枭雄",5203,0,"乱世枭雄","三分天下，为谁争霸，问鼎枭雄就在今天！","0","0","0","0",0,"[1,2,3,4,5,6]","09:00",0));
        put(11001,new Struct_appts_313(11001,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","00:27",0));
        put(11002,new Struct_appts_313(11002,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","02:27",0));
        put(11003,new Struct_appts_313(11003,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","09:27",0));
        put(11004,new Struct_appts_313(11004,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","11:27",0));
        put(11005,new Struct_appts_313(11005,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","13:27",0));
        put(11006,new Struct_appts_313(11006,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","15:27",0));
        put(11007,new Struct_appts_313(11007,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","17:27",0));
        put(11008,new Struct_appts_313(11008,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","19:27",0));
        put(11009,new Struct_appts_313(11009,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","21:27",0));
        put(11010,new Struct_appts_313(11010,"boss战场",6212,0,"boss战场","谁才是最强霸主，战场见分晓!","0","0","0","0",0,"[1,2,3,4,5,6,7]","23:27",0));
        put(12001,new Struct_appts_313(12001,"跨服矿藏",3607,0,"跨服矿藏","家里有矿是一种什么样的体验？","0","0","0","0",8,"[1,2,3,4,5,6,7]","08:00",0));
        put(13001,new Struct_appts_313(13001,"王位争夺",1504,0,"王位争夺","满堂花醉三千客，谁羡当时万户侯。争得一国之君，尔等皆是王臣！","各位主公，争夺王位，可获得海量功勋与元宝~","各位主公，封侯拜相，尽在王位争夺！","0","[2,5]",8,"0","21:30",1));
        put(13002,new Struct_appts_313(13002,"王位争夺",1504,0,"王位争夺","满堂花醉三千客，谁羡当时万户侯。争得一国之君，尔等皆是王臣！","各位主公，争夺王位，可获得海量功勋与元宝~","各位主公，封侯拜相，尽在王位争夺！","0","0",8,"[1,4]","21:30",1));
        put(14001,new Struct_appts_313(14001,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","08:57",0));
        put(14002,new Struct_appts_313(14002,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","09:57",0));
        put(14003,new Struct_appts_313(14003,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","10:57",0));
        put(14004,new Struct_appts_313(14004,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","11:57",0));
        put(14005,new Struct_appts_313(14005,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","12:57",0));
        put(14006,new Struct_appts_313(14006,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","13:57",0));
        put(14007,new Struct_appts_313(14007,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","14:57",0));
        put(14008,new Struct_appts_313(14008,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","15:57",0));
        put(14009,new Struct_appts_313(14009,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","16:57",0));
        put(14010,new Struct_appts_313(14010,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","17:57",0));
        put(14011,new Struct_appts_313(14011,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","18:57",0));
        put(14012,new Struct_appts_313(14012,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","19:57",0));
        put(14013,new Struct_appts_313(14013,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","20:57",0));
        put(14014,new Struct_appts_313(14014,"七擒孟获",1804,0,"七擒孟获","各位主公，南蛮孟获来犯，请速速前去擒拿！","各位主公，孟获来袭，击杀可得丰厚奖励！","0","0","0",2,"[1,2,3,4,5,6,7]","21:57",0));
    }
    public void reset(){
        ins = null;
    }
}