package excel.config;
import com.teamtop.util.excel.ConfigBase;
import excel.struct.Struct_shop_011;
public class Config_shop_011 extends ConfigBase<Struct_shop_011> {
    private static Config_shop_011 ins = null;
    public static Config_shop_011 getIns(){
        if(ins==null){
            ins = new Config_shop_011();
        }
        return ins;
    }
    private Config_shop_011(){
        put(1,new Struct_shop_011(1,"5000元宝",1,10,"充值10元",5000,1000,470011,501));
        put(2,new Struct_shop_011(2,"15000元宝",1,30,"充值30元",15000,3000,470012,502));
        put(3,new Struct_shop_011(3,"49000元宝",1,98,"充值98元",49000,9800,470013,503));
        put(4,new Struct_shop_011(4,"99000元宝",1,198,"充值198元",99000,19800,470014,504));
        put(5,new Struct_shop_011(5,"164000元宝",1,328,"充值328元",164000,32800,470015,505));
        put(6,new Struct_shop_011(6,"324000元宝",1,648,"充值648元",324000,64800,470016,506));
        put(7,new Struct_shop_011(7,"500000元宝",1,1000,"充值1000元",500000,100000,470017,507));
        put(8,new Struct_shop_011(8,"1000000元宝",1,2000,"充值2000元",1000000,200000,470018,508));
        put(109,new Struct_shop_011(109,"1500000元宝",1,3000,"充值3000元",1500000,300000,470031,509));
        put(110,new Struct_shop_011(110,"2500000元宝",1,5000,"充值5000元",2500000,500000,470032,510));
        put(9,new Struct_shop_011(9,"黄金卡",2,0,"黄金卡",9000,600,470019,402));
        put(10,new Struct_shop_011(10,"白金卡",2,0,"白金卡",45000,3000,470020,403));
        put(11,new Struct_shop_011(11,"至尊卡",2,0,"至尊卡",147000,9800,470021,404));
        put(20,new Struct_shop_011(20,"首充3000元宝",3,0,"首充6元",0,600,470024,101));
        put(21,new Struct_shop_011(21,"首充49000元宝",3,0,"首充98元",0,9800,470025,102));
        put(31,new Struct_shop_011(31,"每日直购1",4,0,"每日1元购",0,100,470026,301));
        put(32,new Struct_shop_011(32,"每日直购2",4,0,"每日45元购",0,4500,470027,302));
        put(33,new Struct_shop_011(33,"每日直购3",4,0,"每日98元购",0,9800,470028,303));
        put(41,new Struct_shop_011(41,"庆典基金",5,0,"98元",0,9800,470029,304));
        put(42,new Struct_shop_011(42,"银猪送财",7,0,"30元",15000,3000,470033,305));
        put(43,new Struct_shop_011(43,"金猪送财",7,0,"98元",49000,9800,470034,306));
        put(44,new Struct_shop_011(44,"进阶战令",8,0,"168元",84000,16800,470035,307));
        put(45,new Struct_shop_011(45,"合服600元宝",3,0,"合服6元",0,600,470036,201));
        put(46,new Struct_shop_011(46,"合服9800元宝",3,0,"合服98元",0,9800,470037,202));
        put(51,new Struct_shop_011(51,"尊享周卡",6,0,"35元",70000,3500,470030,401));
        put(52,new Struct_shop_011(52,"聚宝盆198元",11,0,"聚宝盆-战力返利",0,19800,470048,511));
        put(53,new Struct_shop_011(53,"聚宝盆648元",11,0,"聚宝盆-等级返利",0,64800,470047,512));
        put(201,new Struct_shop_011(201,"限时礼包转生1",9,0,"2转豪华礼包",0,600,470101,308));
        put(202,new Struct_shop_011(202,"限时礼包转生2",9,0,"2转至尊礼包",0,1800,470102,309));
        put(203,new Struct_shop_011(203,"限时礼包转生3",9,0,"3转豪华礼包",0,1200,470103,310));
        put(204,new Struct_shop_011(204,"限时礼包转生4",9,0,"3转至尊礼包",0,4500,470104,311));
        put(205,new Struct_shop_011(205,"限时礼包转生5",9,0,"4转豪华礼包",0,3000,470105,312));
        put(206,new Struct_shop_011(206,"限时礼包转生6",9,0,"4转至尊礼包",0,12800,470106,313));
        put(207,new Struct_shop_011(207,"限时礼包转生7",9,0,"5转豪华礼包",0,3000,470107,314));
        put(208,new Struct_shop_011(208,"限时礼包转生8",9,0,"5转至尊礼包",0,19800,470108,315));
        put(209,new Struct_shop_011(209,"限时礼包地图1",9,0,"地图第4章豪华礼包",0,600,470109,316));
        put(210,new Struct_shop_011(210,"限时礼包地图2",9,0,"地图第4章至尊礼包",0,1800,470110,317));
        put(211,new Struct_shop_011(211,"限时礼包地图3",9,0,"地图第5章豪华礼包",0,1200,470111,318));
        put(212,new Struct_shop_011(212,"限时礼包地图4",9,0,"地图第5章至尊礼包",0,3000,470112,319));
        put(213,new Struct_shop_011(213,"限时礼包地图5",9,0,"地图第8章豪华礼包",0,1800,470113,320));
        put(214,new Struct_shop_011(214,"限时礼包地图6",9,0,"地图第8章至尊礼包",0,4500,470114,321));
        put(215,new Struct_shop_011(215,"限时礼包地图7",9,0,"地图第9章豪华礼包",0,1800,470115,322));
        put(216,new Struct_shop_011(216,"限时礼包地图8",9,0,"地图第9章至尊礼包",0,4500,470116,323));
        put(217,new Struct_shop_011(217,"限时礼包红将1",9,0,"收集1个红将豪华礼包",0,1800,470117,324));
        put(218,new Struct_shop_011(218,"限时礼包红将2",9,0,"收集1个红将至尊礼包",0,6800,470118,325));
        put(219,new Struct_shop_011(219,"限时礼包红将3",9,0,"收集2个红将豪华礼包",0,3000,470119,326));
        put(220,new Struct_shop_011(220,"限时礼包红将4",9,0,"收集2个红将至尊礼包",0,9800,470120,327));
        put(221,new Struct_shop_011(221,"限时礼包红将5",9,0,"收集3个红将豪华礼包",0,3000,470121,328));
        put(222,new Struct_shop_011(222,"限时礼包红将6",9,0,"收集3个红将至尊礼包",0,12800,470122,329));
        put(223,new Struct_shop_011(223,"限时礼包红将7",9,0,"收集4个红将豪华礼包",0,4500,470123,330));
        put(224,new Struct_shop_011(224,"限时礼包红将8",9,0,"收集4个红将至尊礼包",0,19800,470124,331));
        put(225,new Struct_shop_011(225,"限时礼包红将9",9,0,"收集5个红将豪华礼包",0,4500,470125,332));
        put(226,new Struct_shop_011(226,"限时礼包红将10",9,0,"收集5个红将至尊礼包",0,19800,470126,333));
        put(227,new Struct_shop_011(227,"限时礼包一骑当千1",9,0,"一骑当千普通豪华礼包",0,1200,470127,334));
        put(228,new Struct_shop_011(228,"限时礼包一骑当千2",9,0,"一骑当千普通至尊礼包",0,4500,470128,335));
        put(229,new Struct_shop_011(229,"限时礼包一骑当千3",9,0,"一骑当千困难豪华礼包",0,1800,470129,336));
        put(230,new Struct_shop_011(230,"限时礼包一骑当千4",9,0,"一骑当千困难至尊礼包",0,6800,470130,337));
        put(231,new Struct_shop_011(231,"限时礼包一骑当千5",9,0,"一骑当千噩梦豪华礼包",0,3000,470131,338));
        put(232,new Struct_shop_011(232,"限时礼包一骑当千6",9,0,"一骑当千噩梦至尊礼包",0,12800,470132,339));
        put(233,new Struct_shop_011(233,"限时礼包一骑当千7",9,0,"一骑当千传说豪华礼包",0,3000,470133,340));
        put(234,new Struct_shop_011(234,"限时礼包一骑当千8",9,0,"一骑当千传说至尊礼包",0,19800,470134,341));
        put(243,new Struct_shop_011(243,"超值礼包-周礼包",12,98,"超值礼包-周礼包",0,9800,470053,344));
        put(244,new Struct_shop_011(244,"超值礼包-周礼包",12,198,"超值礼包-周礼包",0,19800,470054,345));
        put(245,new Struct_shop_011(245,"超值礼包-周礼包",12,328,"超值礼包-周礼包",0,32800,470055,346));
        put(246,new Struct_shop_011(246,"超值礼包-周礼包",12,648,"超值礼包-周礼包",0,64800,470056,347));
        put(247,new Struct_shop_011(247,"超值礼包-周礼包",12,998,"超值礼包-周礼包",0,99800,470057,348));
        put(248,new Struct_shop_011(248,"超值礼包-周礼包",12,1998,"超值礼包-周礼包",0,199800,470058,349));
        put(249,new Struct_shop_011(249,"超值礼包-周礼包",12,3000,"超值礼包-周礼包",0,300000,470059,350));
        put(250,new Struct_shop_011(250,"超值礼包-周礼包",12,5000,"超值礼包-周礼包",0,500000,470060,351));
        put(253,new Struct_shop_011(253,"超值礼包-月礼包",13,98,"超值礼包-月礼包",0,9800,470063,354));
        put(254,new Struct_shop_011(254,"超值礼包-月礼包",13,198,"超值礼包-月礼包",0,19800,470064,355));
        put(255,new Struct_shop_011(255,"超值礼包-月礼包",13,328,"超值礼包-月礼包",0,32800,470065,356));
        put(256,new Struct_shop_011(256,"超值礼包-月礼包",13,648,"超值礼包-月礼包",0,64800,470066,357));
        put(257,new Struct_shop_011(257,"超值礼包-月礼包",13,998,"超值礼包-月礼包",0,99800,470067,358));
        put(258,new Struct_shop_011(258,"超值礼包-月礼包",13,1998,"超值礼包-月礼包",0,199800,470068,359));
        put(259,new Struct_shop_011(259,"超值礼包-月礼包",13,3000,"超值礼包-月礼包",0,300000,470069,360));
        put(260,new Struct_shop_011(260,"超值礼包-月礼包",13,5000,"超值礼包-月礼包",0,500000,470070,361));
        put(401,new Struct_shop_011(401,"高级犒赏令（系统）",10,50,"高级犒赏令（系统）",0,5000,470135,401));
        put(402,new Struct_shop_011(402,"荣誉勋章（系统）",10,128,"荣誉勋章（系统）",0,12800,470136,402));
        put(403,new Struct_shop_011(403,"高级犒赏令（活动）",10,50,"高级犒赏令（活动）",0,5000,470137,403));
        put(404,new Struct_shop_011(404,"荣誉勋章（活动）",10,128,"荣誉勋章（活动）",0,12800,470138,404));
    }
    public void reset(){
        ins = null;
    }
}