package excel.config;
import com.teamtop.util.excel.ConfigBase;
import excel.struct.Struct_lzd_234;
public class Config_lzd_234 extends ConfigBase<Struct_lzd_234> {
    private static Config_lzd_234 ins = null;
    public static Config_lzd_234 getIns(){
        if(ins==null){
            ins = new Config_lzd_234();
        }
        return ins;
    }
    private Config_lzd_234(){
        put(1,new Struct_lzd_234(1,"【三国】三英战吕布中，三英不包括哪一位？","张郃","刘备","关羽","张飞"));
        put(2,new Struct_lzd_234(2,"【三国】截江救阿斗的是哪位将军？","赵云","黄忠","马超","魏延"));
        put(3,new Struct_lzd_234(3,"【三国】典故“青梅煮酒”出自哪两个人？","曹操和刘备","曹操和孙权","刘备和孙权","刘备和诸葛亮"));
        put(4,new Struct_lzd_234(4,"【三国】官渡之战的胜利方是谁？","曹操","袁绍","刘备","孙权"));
        put(5,new Struct_lzd_234(5,"【三国】典故“身在曹营心在汉”说的是谁？","徐庶","鲁肃","郭嘉","庞统"));
        put(6,new Struct_lzd_234(6,"【三国】典故“士别三日当刮目相待”说的是谁？","吕蒙","徐晃","陆逊","贾诩"));
        put(7,new Struct_lzd_234(7,"【三国】刘备早年是做什么的？","卖草鞋","屠夫","卖枣子","做生意"));
        put(8,new Struct_lzd_234(8,"【三国】关羽号称什么？","武圣","战神","斗帝","常胜将军"));
        put(9,new Struct_lzd_234(9,"【三国】诸葛亮号称什么？","卧龙","水镜","锦帆贼","徐福"));
        put(10,new Struct_lzd_234(10,"【三国】《三国演义》中哪国最终一统了天下？","晋","魏","蜀","吴"));
        put(11,new Struct_lzd_234(11,"【三国】被称为“虎痴”的是谁？","许褚","张飞","典韦","太史慈"));
        put(12,new Struct_lzd_234(12,"【三国】“蜀国五虎”不包括谁？","魏延","黄忠","赵云","马超"));
        put(13,new Struct_lzd_234(13,"【三国】《七步诗》的创作者是谁？","曹植","曹丕","曹冲","曹操"));
        put(14,new Struct_lzd_234(14,"【三国】关羽被谁所擒获？","吕蒙","甘宁","周泰","张辽"));
        put(15,new Struct_lzd_234(15,"【三国】三国时期的名医是谁？","华佗","扁鹊","张仲景","孙思邈"));
        put(16,new Struct_lzd_234(16,"【三国】《三国演义》的作者是谁？","罗贯中","吴承恩","施耐庵","曹雪芹"));
        put(17,new Struct_lzd_234(17,"【三国】威震逍遥津的是哪位将军？","张辽","吕布","关羽","庞德"));
        put(18,new Struct_lzd_234(18,"【三国】被称为“小霸王”的是谁？","孙策","于禁","乐进","姜维"));
        put(19,new Struct_lzd_234(19,"【三国】曹操使用了谁的计谋平定了辽东？","郭嘉","荀彧","程昱","荀攸"));
        put(20,new Struct_lzd_234(20,"【三国】三国中的独眼将军是谁？","夏侯惇","夏侯渊","曹仁","廖化"));
        put(21,new Struct_lzd_234(21,"【灯谜】日月潭边春色满 （打一节日）","清明","谷雨","立春","惊蛰"));
        put(22,new Struct_lzd_234(22,"【灯谜】我没有他有，天没有地有（打一字）","也","你","人","海"));
        put(23,new Struct_lzd_234(23,"【灯谜】傻瓜（打一字）","保","吃","湖","吉"));
        put(24,new Struct_lzd_234(24,"【灯谜】七仙女嫁出去一个（打一成语）","六神无主","朝不保夕","天上人间","金玉良缘"));
        put(25,new Struct_lzd_234(25,"【灯谜】二三四五六七八九(打一成语)","缺衣少食","千军万马","日日夜夜","时光荏苒"));
        put(26,new Struct_lzd_234(26,"【灯谜】皇(打一成语)","白玉无瑕","一见钟情","凤凰于飞","一生一世"));
        put(27,new Struct_lzd_234(27,"【灯谜】骂不还口(打一动物)","马","狗","猫","驴"));
        put(28,new Struct_lzd_234(28,"【灯谜】华而不实(打一植物)","无花果","苹果","哈密瓜","菠萝"));
        put(29,new Struct_lzd_234(29,"【灯谜】多兄长(打一动物)","八哥","鹦鹉","乌龟","老鼠"));
        put(30,new Struct_lzd_234(30,"【灯谜】拍一个巴掌 (打一地名)","五指山","泰山","华山","终南山"));
        put(31,new Struct_lzd_234(31,"【灯谜】乖(打一成语)","乘人不备","守株待兔","雷霆万钧","笑逐颜开"));
        put(32,new Struct_lzd_234(32,"【灯谜】屡试屡成(打一动物)","百灵鸟","貂","狼","老虎"));
        put(33,new Struct_lzd_234(33,"【灯谜】让妲己做先锋（打一人名）","令狐冲","韦小宝","姜子牙","任盈盈"));
        put(34,new Struct_lzd_234(34,"【灯谜】男人占多数（打一字）","妙","链","六","版"));
        put(35,new Struct_lzd_234(35,"【灯谜】十五天（打一字）","胖","色","台","屏"));
        put(36,new Struct_lzd_234(36,"【灯谜】一家有四口，还要养只狗（打一字）","器","现","种","民"));
        put(37,new Struct_lzd_234(37,"【灯谜】黄昏（打一地名）","洛阳","北京","上海","广州"));
        put(38,new Struct_lzd_234(38,"【灯谜】七人写八字（打一学科）","化学","物理","历史","地理"));
        put(39,new Struct_lzd_234(39,"【灯谜】八戒过火焰山（打一菜肴）","红烧猪蹄","辣椒炒肉","碳烤生蚝","茶油烧鸡"));
        put(40,new Struct_lzd_234(40,"【灯谜】在树上唱RAP（打一字）","桑","木","森","禾"));
        put(41,new Struct_lzd_234(41,"【知识】地球上已知最大的生物是什么？","蓝鲸","大象","河马","犀牛"));
        put(42,new Struct_lzd_234(42,"【知识】红蓝黄三色相加得到什么颜色？","黑色","白色","红色","彩色"));
        put(43,new Struct_lzd_234(43,"【知识】绝对零度是多少摄氏度？","-273°","0°","-100°","-1000°"));
        put(44,new Struct_lzd_234(44,"【知识】《四库全书》是哪位皇帝下令编著的？","乾隆","雍正","康熙","顺治"));
        put(45,new Struct_lzd_234(45,"【知识】哪位科学家建立了狭义相对论和广义相对论？","爱因斯坦","爱迪生","牛顿","伽利略"));
        put(46,new Struct_lzd_234(46,"【知识】金庸先生最后写的一部小说叫什么？","鹿鼎记","笑傲江湖","雪山飞狐","书剑恩仇录"));
        put(47,new Struct_lzd_234(47,"【知识】人民英雄纪念碑高多少米？","37.94米","40.94米","30.94米","47.94米"));
        put(48,new Struct_lzd_234(48,"【知识】人体有多少块骨骼？","206","200","230","203"));
        put(49,new Struct_lzd_234(49,"【知识】篮球飞人乔丹曾几次获得最佳球员？","5次","3次","6次","4次"));
        put(50,new Struct_lzd_234(50,"【知识】中国古代文学史上现存诗最多的是谁？","陆游","李白","杜甫","陶渊明"));
        put(51,new Struct_lzd_234(51,"【知识】苏伊士运河位于哪个国家？","埃及","印度","英国","法国"));
        put(52,new Struct_lzd_234(52,"【知识】乒乓球于哪一年进入奥运会?","1988年","1989年","1990年","1986年"));
        put(53,new Struct_lzd_234(53,"【知识】世界上最大的峡谷在哪个国家?","美国","中国","俄罗斯","澳大利亚"));
        put(54,new Struct_lzd_234(54,"【知识】被鲁迅称为“史家之绝唱,无韵之离骚”的作品是?","史记","三国志","春秋","二十四史"));
        put(55,new Struct_lzd_234(55,"【知识】我国目前最早的砖墙出现在哪个朝代?","秦朝","汉朝","商朝","夏朝"));
        put(56,new Struct_lzd_234(56,"【知识】我国第一大河长江有多长?","6300千米","6600千米","6000千米","6200千米"));
        put(57,new Struct_lzd_234(57,"【知识】太阳系中最大的行星是什么星?","木星","水星","冥王星","土星"));
        put(58,new Struct_lzd_234(58,"【知识】愚人节这天可以撒谎的习俗是来自哪个国家的?","法国","荷兰","墨西哥","西班牙"));
        put(59,new Struct_lzd_234(59,"【知识】世界上发明地震仪最早的是哪个国家?","中国","沙特阿拉伯","葡萄牙","加拿大"));
        put(60,new Struct_lzd_234(60,"【知识】“五岳”中的南岳是指哪座山?","衡山","华山","泰山","黄山"));
        put(61,new Struct_lzd_234(61,"【急转弯】你想让蚊子叮在哪里？","别人身上","手上","脸上","腿上"));
        put(62,new Struct_lzd_234(62,"【急转弯】什么水果最忙？","芒果","苹果","橘子","火龙果"));
        put(63,new Struct_lzd_234(63,"【急转弯】什么动物最怕水？","鸡","兔子","猫","老虎"));
        put(64,new Struct_lzd_234(64,"【急转弯】在什么地方说的话最不可信？","飞机","汽车","轮船","火车"));
        put(65,new Struct_lzd_234(65,"【急转弯】一个人在什么时候最贫穷？","出生","结婚","恋爱","生子"));
        put(66,new Struct_lzd_234(66,"【急转弯】西红柿的儿子是谁？","柿子","柚子","瓜子","葡萄"));
        put(67,new Struct_lzd_234(67,"【急转弯】1-100谁最有钱？","94","100","88","1"));
        put(68,new Struct_lzd_234(68,"【急转弯】五行之中谁的腿最长？","火","水","金","木"));
        put(69,new Struct_lzd_234(69,"【急转弯】把鸟放进锅里会变成什么？","菜鸟","笨鸟","火鸟","小鸟"));
        put(70,new Struct_lzd_234(70,"【急转弯】什么动物天天熬夜？","熊猫","狮子","美洲豹","蛇"));
        put(71,new Struct_lzd_234(71,"【街机】大鹏展翅是谁的招式？","赵云","张飞","貂蝉","诸葛亮"));
        put(72,new Struct_lzd_234(72,"【街机】诸葛亮的神技叫什么？","呼风唤雨","雷霆万钧","万箭穿心","霹雳火"));
    }
    public void reset(){
        ins = null;
    }
}