package excel.config;
import com.teamtop.util.excel.ConfigBase;
import excel.struct.Struct_sb_750;
public class Config_sb_750 extends ConfigBase<Struct_sb_750> {
    private static Config_sb_750 ins = null;
    public static Config_sb_750 getIns(){
        if(ins==null){
            ins = new Config_sb_750();
        }
        return ins;
    }
    private Config_sb_750(){
        put(2000,new Struct_sb_750(2000,2,"霹雳火剑","[[1,443001,1]]",50,10,0,4,80,200));
        put(4000,new Struct_sb_750(4000,4,"伏云剑","[[1,443002,1]]",100,20,5,5,70,200));
        put(5000,new Struct_sb_750(5000,5,"疾风电剑","[[1,443003,1]]",50,10,0,4,80,200));
        put(6000,new Struct_sb_750(6000,6,"丈八蛇矛","[[1,443004,1]]",220,30,10,6,60,200));
        put(7000,new Struct_sb_750(7000,7,"青龙偃月刀","[[1,443005,1]]",220,30,10,6,60,200));
        put(8000,new Struct_sb_750(8000,8,"麒麟牙","[[1,443006,1]]",50,10,0,4,80,200));
        put(9000,new Struct_sb_750(9000,9,"玄铁鸳鸯锏","[[1,443007,1]]",100,20,5,5,70,200));
        put(10000,new Struct_sb_750(10000,10,"流星锤","[[1,443008,1]]",220,30,10,6,60,200));
        put(11000,new Struct_sb_750(11000,11,"神龙钩镰刀","[[1,443009,1]]",100,20,5,5,70,200));
        put(12000,new Struct_sb_750(12000,12,"方天画戟","[[1,443010,1]]",220,30,10,6,60,200));
        put(13000,new Struct_sb_750(13000,13,"旋风斩","[[1,443011,1]]",100,20,5,5,70,200));
        put(15000,new Struct_sb_750(15000,15,"九元天乾剑","[[1,443012,1]]",220,30,10,6,60,200));
        put(51000,new Struct_sb_750(51000,51,"五火神焰扇","[[1,443013,1]]",300,50,10,8,60,200));
        put(52000,new Struct_sb_750(52000,52,"龙胆亮银枪","[[1,443014,1]]",300,50,10,8,60,200));
        put(53000,new Struct_sb_750(53000,53,"桃花扇","[[1,443015,1]]",300,50,10,8,60,200));
        put(54000,new Struct_sb_750(54000,54,"凤翅镏金镋","[[1,443016,1]]",300,50,10,8,60,200));
    }
    public void reset(){
        ins = null;
    }
}